http-benchmarks/output/run-httpserv_go-45000-1000.txt
Running 1m test @ http://localhost:8080
  24 threads and 1000 connections
  Thread calibration: mean lat.: 1405.832ms, rate sampling interval: 5218ms
  Thread calibration: mean lat.: 1366.721ms, rate sampling interval: 5124ms
  Thread calibration: mean lat.: 1441.671ms, rate sampling interval: 5324ms
  Thread calibration: mean lat.: 1402.833ms, rate sampling interval: 5201ms
  Thread calibration: mean lat.: 1421.119ms, rate sampling interval: 5173ms
  Thread calibration: mean lat.: 1291.272ms, rate sampling interval: 4722ms
  Thread calibration: mean lat.: 1450.681ms, rate sampling interval: 5341ms
  Thread calibration: mean lat.: 1449.436ms, rate sampling interval: 5308ms
  Thread calibration: mean lat.: 1443.278ms, rate sampling interval: 5255ms
  Thread calibration: mean lat.: 1415.782ms, rate sampling interval: 5214ms
  Thread calibration: mean lat.: 1400.169ms, rate sampling interval: 5230ms
  Thread calibration: mean lat.: 1376.337ms, rate sampling interval: 5152ms
  Thread calibration: mean lat.: 1357.057ms, rate sampling interval: 5107ms
  Thread calibration: mean lat.: 1408.207ms, rate sampling interval: 5181ms
  Thread calibration: mean lat.: 1410.715ms, rate sampling interval: 5152ms
  Thread calibration: mean lat.: 1354.368ms, rate sampling interval: 5087ms
  Thread calibration: mean lat.: 1368.718ms, rate sampling interval: 5070ms
  Thread calibration: mean lat.: 1416.671ms, rate sampling interval: 5259ms
  Thread calibration: mean lat.: 1369.492ms, rate sampling interval: 5074ms
  Thread calibration: mean lat.: 1361.713ms, rate sampling interval: 5066ms
  Thread calibration: mean lat.: 1357.327ms, rate sampling interval: 4968ms
  Thread calibration: mean lat.: 1170.617ms, rate sampling interval: 4276ms
  Thread calibration: mean lat.: 1330.581ms, rate sampling interval: 4935ms
  Thread calibration: mean lat.: 1291.235ms, rate sampling interval: 4763ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.80s     4.12s   18.58s    58.89%
    Req/Sec     1.34k    17.68     1.41k    81.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    9.73s 
 75.000%   13.25s 
 90.000%   15.50s 
 99.000%   17.53s 
 99.900%   18.14s 
 99.990%   18.40s 
 99.999%   18.51s 
100.000%   18.60s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1944.575     0.000000            1         1.00
    4186.111     0.100000       160827         1.11
    5558.271     0.200000       321374         1.25
    6930.431     0.300000       482044         1.43
    8331.263     0.400000       642621         1.67
    9732.095     0.500000       803497         2.00
   10436.607     0.550000       883839         2.22
   11141.119     0.600000       964619         2.50
   11837.439     0.650000      1044337         2.86
   12550.143     0.700000      1125132         3.33
   13254.655     0.750000      1205297         4.00
   13606.911     0.775000      1245421         4.44
   13967.359     0.800000      1285868         5.00
   14327.807     0.825000      1325358         5.71
   14704.639     0.850000      1365509         6.67
   15097.855     0.875000      1406206         8.00
   15294.463     0.887500      1426222         8.89
   15499.263     0.900000      1446425        10.00
   15704.063     0.912500      1465881        11.43
   15933.439     0.925000      1486566        13.33
   16162.815     0.937500      1506440        16.00
   16285.695     0.943750      1516487        17.78
   16408.575     0.950000      1526090        20.00
   16547.839     0.956250      1536469        22.86
   16687.103     0.962500      1546291        26.67
   16842.751     0.968750      1556383        32.00
   16924.671     0.971875      1561433        35.56
   17022.975     0.975000      1567116        40.00
   17104.895     0.978125      1571612        45.71
   17203.199     0.981250      1576665        53.33
   17317.887     0.984375      1582039        64.00
   17367.039     0.985938      1584210        71.11
   17416.191     0.987500      1586327        80.00
   17481.727     0.989062      1589000        91.43
   17547.263     0.990625      1591454       106.67
   17629.183     0.992188      1594245       128.00
   17661.951     0.992969      1595254       142.22
   17711.103     0.993750      1596704       160.00
   17760.255     0.994531      1598061       182.86
   17793.023     0.995313      1598896       213.33
   17858.559     0.996094      1600470       256.00
   17874.943     0.996484      1600825       284.44
   17907.711     0.996875      1601515       320.00
   17940.479     0.997266      1602111       365.71
   17973.247     0.997656      1602687       426.67
   18022.399     0.998047      1603446       512.00
   18038.783     0.998242      1603671       568.89
   18055.167     0.998437      1603900       640.00
   18087.935     0.998633      1604324       731.43
   18104.319     0.998828      1604520       853.33
   18137.087     0.999023      1604873      1024.00
   18153.471     0.999121      1605036      1137.78
   18169.855     0.999219      1605176      1280.00
   18202.623     0.999316      1605409      1462.86
   18219.007     0.999414      1605528      1706.67
   18235.391     0.999512      1605635      2048.00
   18251.775     0.999561      1605727      2275.56
   18268.159     0.999609      1605822      2560.00
   18284.543     0.999658      1605898      2925.71
   18300.927     0.999707      1605967      3413.33
   18317.311     0.999756      1606027      4096.00
   18333.695     0.999780      1606083      4551.11
   18350.079     0.999805      1606136      5120.00
   18350.079     0.999829      1606136      5851.43
   18366.463     0.999854      1606182      6826.67
   18382.847     0.999878      1606222      8192.00
   18399.231     0.999890      1606259      9102.22
   18399.231     0.999902      1606259     10240.00
   18415.615     0.999915      1606292     11702.86
   18415.615     0.999927      1606292     13653.33
   18431.999     0.999939      1606316     16384.00
   18431.999     0.999945      1606316     18204.44
   18448.383     0.999951      1606337     20480.00
   18448.383     0.999957      1606337     23405.71
   18464.767     0.999963      1606356     27306.67
   18464.767     0.999969      1606356     32768.00
   18464.767     0.999973      1606356     36408.89
   18481.151     0.999976      1606369     40960.00
   18481.151     0.999979      1606369     46811.43
   18497.535     0.999982      1606377     54613.33
   18497.535     0.999985      1606377     65536.00
   18513.919     0.999986      1606384     72817.78
   18513.919     0.999988      1606384     81920.00
   18513.919     0.999989      1606384     93622.86
   18530.303     0.999991      1606392    109226.67
   18530.303     0.999992      1606392    131072.00
   18530.303     0.999993      1606392    145635.56
   18530.303     0.999994      1606392    163840.00
   18530.303     0.999995      1606392    187245.71
   18546.687     0.999995      1606395    218453.33
   18546.687     0.999996      1606395    262144.00
   18546.687     0.999997      1606395    291271.11
   18563.071     0.999997      1606397    327680.00
   18563.071     0.999997      1606397    374491.43
   18563.071     0.999998      1606397    436906.67
   18563.071     0.999998      1606397    524288.00
   18579.455     0.999998      1606399    582542.22
   18579.455     0.999998      1606399    655360.00
   18579.455     0.999999      1606399    748982.86
   18579.455     0.999999      1606399    873813.33
   18579.455     0.999999      1606399   1048576.00
   18579.455     0.999999      1606399   1165084.44
   18579.455     0.999999      1606399   1310720.00
   18579.455     0.999999      1606399   1497965.71
   18595.839     0.999999      1606400   1747626.67
   18595.839     1.000000      1606400          inf
#[Mean    =     9797.140, StdDeviation   =     4123.902]
#[Max     =    18579.456, Total count    =      1606400]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1932119 requests in 1.00m, 3.94GB read
Requests/sec:  32203.83
Transfer/sec:     67.26MB

JSON Output:
{
	"requests": 1932119,
	"duration_in_microseconds": 59996555.00,
	"bytes": 4231340610,
	"requests_per_sec": 32203.83,
	"bytes_transfer_per_sec": 70526392.89,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 9732095
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 13254655
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 15499263
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 17530879
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 18137087
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 18399231
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 18513919
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 18595839
		}
	]
}